---
kind: property
id: P:Autodesk.Revit.DB.DirectShape.TypeId
source: html/349629c7-eb65-d4bd-801b-115e1a52878d.htm
---
# Autodesk.Revit.DB.DirectShape.TypeId Property

Element id of a DirectShapeType object that holds properties to be shared by this element. Optional.

## Syntax (C#)
```csharp
public ElementId TypeId { get; }
```